In [2]:
import pandas as pd
import numpy as np

In [3]:
PATH_DATA = '/home/gustavo/Documents/Study/005_Python_General/github/python_practice/09_libraries/00_data/gapminder.csv'
PATH_DATA_2= '/home/gustavo/repos/Python_practice/09_libraries/00_data/gapminder.csv'

df = pd.read_csv(PATH_DATA, delimiter=',', index_col=0)
df.head(3)

        country  year  population    cont  life_exp      gdp_cap
11  Afghanistan  2007  31889923.0    Asia    43.828   974.580338
23      Albania  2007   3600523.0  Europe    76.423  5937.029526
35      Algeria  2007  33333216.0  Africa    72.301  6223.367465

## Summary statistics. life_exp

In [ ]:
# median of the column 'life_exp'

median = df['life_exp'].median()
print(median)

71.93549999999999

In [ ]:
# maximum value of the column 'life_exp"

maximum = df['life_exp'].max()
print(maximum)

82.603

In [ ]:
# minumum value of the column 'life_exp'

minimum = df['life_exp'].min()
print(minimum)

39.613

In [ ]:
# mean of the column 'life_exp'

mean = df['life_exp'].mean()
print(mean)

67.00742253521126

### Cumulative statistics

In [7]:
# cumulative sum: .cumsum()

df['population'].cumsum()

11      3.188992e+07
23      3.549045e+07
35      6.882366e+07
47      8.124414e+07
59      1.215461e+08
            ...
1655    6.200726e+09
1667    6.204744e+09
1679    6.226956e+09
1691    6.238702e+09
1703    6.251013e+09
Name: population, Length: 142, dtype: float64

In [8]:
df['population'].cummax()

11      3.188992e+07
23      3.188992e+07
35      3.333322e+07
47      3.333322e+07
59      4.030193e+07
            ...
1655    1.318683e+09
1667    1.318683e+09
1679    1.318683e+09
1691    1.318683e+09
1703    1.318683e+09
Name: population, Length: 142, dtype: float64

In [9]:
df['population'].cummin()

11      31889923.0
23       3600523.0
35       3600523.0
47       3600523.0
59       3600523.0
           ...
1655      199579.0
1667      199579.0
1679      199579.0
1691      199579.0
1703      199579.0
Name: population, Length: 142, dtype: float64

## Sales data

In [10]:
# sales data

SALES_DATA = '/home/gustavo/Documents/Study/005_Python_General/github/python_practice/09_libraries/00_data/sales_subset.csv'
SALES_DATA_2 = '/home/gustavo/repos/Python_practice/09_libraries/00_data/sales_subset.csv'


sales_df = pd.read_csv(SALES_DATA, delimiter=',', index_col=0)

In [11]:
sales_df

,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
1,1,A,1,2010-03-05,21827.90,False,8.055556,0.693452,8.106
2,1,A,1,2010-04-02,57258.43,False,16.816667,0.718284,7.808
3,1,A,1,2010-05-07,17413.94,False,22.527778,0.748928,7.808
4,1,A,1,2010-06-04,17558.09,False,27.050000,0.714586,7.808
...,...,...,...,...,...,...,...,...,...
10769,39,A,99,2011-12-09,895.00,False,9.644444,0.834256,7.716
10770,39,A,99,2012-02-03,350.00,False,15.938889,0.887619,7.244
10771,39,A,99,2012-06-08,450.00,False,27.288889,0.911922,6.989
10772,39,A,99,2012-07-13,0.06,False,25.644444,0.860145,6.623
10773,39,A,99,2012-10-05,915.00,False,22.250000,0.955511,6.228

In [12]:
sales_df['weekly_sales'].mean()

np.float64(23843.95014850566)

In [13]:
sales_df['weekly_sales'].median()

np.float64(12049.064999999999)

## Duplicates

In [14]:
# Drop duplicate store/type combinations

store_types = sales_df.drop_duplicates(subset=(['store','type']))
store_types

,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
901,2,A,1,2010-02-05,35034.06,False,4.550000,0.679451,8.324
1798,4,A,1,2010-02-05,38724.42,False,6.533333,0.686319,8.623
2699,6,A,1,2010-02-05,25619.00,False,4.683333,0.679451,7.259
3593,10,B,1,2010-02-05,40212.84,False,12.411111,0.782478,9.765
4495,13,A,1,2010-02-05,46761.90,False,-0.261111,0.704283,8.316
5408,14,A,1,2010-02-05,32842.31,False,-2.605556,0.735455,8.992
6293,19,A,1,2010-02-05,21500.58,False,-6.133333,0.780365,8.350
7199,20,A,1,2010-02-05,46021.21,False,-3.377778,0.735455,8.187
8109,27,A,1,2010-02-05,32313.79,False,-2.672222,0.780365,8.237
9009,31,A,1,2010-02-05,18187.71,False,3.916667,0.679451,8.324
9899,39,A,1,2010-02-05,21244.50,False,6.833333,0.679451,8.554

In [15]:
# Drop duplicates store/department combinations

store_depts = sales_df.drop_duplicates(subset=(['store','department']))
store_depts.head()

,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
12,1,A,2,2010-02-05,50605.27,False,5.727778,0.679451,8.106
24,1,A,3,2010-02-05,13740.12,False,5.727778,0.679451,8.106
36,1,A,4,2010-02-05,39954.04,False,5.727778,0.679451,8.106
48,1,A,5,2010-02-05,32229.38,False,5.727778,0.679451,8.106

In [16]:
# Subset the rows where is_holiday is True and drop duplicate dates

holiday_dates = sales_df[sales_df['is_holiday']].drop_duplicates('date')
holiday_dates

,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
498,1,A,45,2010-09-10,11.47,True,25.938889,0.677602,7.787
691,1,A,77,2011-11-25,1431.00,True,15.633333,0.854861,7.866
2315,4,A,47,2010-02-12,498.00,True,-1.755556,0.679715,8.623
6735,19,A,39,2012-09-07,13.41,True,22.333333,1.076766,8.193
6810,19,A,47,2010-12-31,-449.00,True,-1.861111,0.881278,8.067
6815,19,A,47,2012-02-10,15.00,True,0.338889,1.010723,7.943
6820,19,A,48,2011-09-09,197.00,True,20.155556,1.038197,7.806

## Counting categorical variables

In [17]:
store_counts = store_types['type'].value_counts()
store_counts

type
A    11
B     1
Name: count, dtype: int64

In [18]:
store_props = store_types['type'].value_counts(normalize=True)
store_props

type
A    0.916667
B    0.083333
Name: proportion, dtype: float64

In [19]:
# Count the number of stores of each type

store_counts = store_types['type'].value_counts()
store_counts

type
A    11
B     1
Name: count, dtype: int64

In [20]:
# Get the proportion of stores of each type

store_props = store_types['type'].value_counts(normalize=True)
store_props

type
A    0.916667
B    0.083333
Name: proportion, dtype: float64

In [21]:
# Count the number of stores for each department and sort

dept_counts_sorted = store_depts['department'].value_counts().sort_values(ascending=False)
dept_counts_sorted

department
1     12
2     12
3     12
4     12
5     12
      ..
37    10
48     8
50     6
39     4
43     2
Name: count, Length: 80, dtype: int64

In [22]:
# Get the proportion of stores in each department and sort

dept_props_sorted = store_depts['department'].value_counts(normalize=True).sort_values(ascending=False)
dept_props_sorted

department
1     0.012917
2     0.012917
3     0.012917
4     0.012917
5     0.012917
        ...
37    0.010764
48    0.008611
50    0.006459
39    0.004306
43    0.002153
Name: proportion, Length: 80, dtype: float64

## Summaries by group

In [3]:
# Agrupamiento: ('categorical column')['numerical column']

df.groupby("cont")["population"].mean()

cont
Africa      1.787576e+07
Americas    3.595485e+07
Asia        1.155138e+08
Europe      1.953662e+07
Oceania     1.227497e+07
Name: population, dtype: float64

In [5]:
df.groupby("cont")["population"].agg(["min", "max", "sum"])

                min           max           sum
cont
Africa     199579.0  1.350312e+08  9.295397e+08
Americas  1056608.0  3.011399e+08  8.988712e+08
Asia       708573.0  1.318683e+09  3.811954e+09
Europe     301931.0  8.240100e+07  5.860985e+08
Oceania   4115771.0  2.043418e+07  2.454995e+07

In [4]:
africa = df['cont'] == "Africa"
mini = df[africa].sort_values('population').head(1)
mini

                    country  year  population    cont  life_exp      gdp_cap
1307  Sao Tome and Principe  2007    199579.0  Africa    65.528  1598.435089

In [5]:
maxi = df[africa].sort_values('population').tail(1)
maxi

      country  year   population    cont  life_exp      gdp_cap
1139  Nigeria  2007  135031164.0  Africa    46.859  2013.977305